In [1]:
import pandas as pd

In [35]:
d1 = pd.read_csv(r"C:\Users\nibed\Desktop\Freelance\AD\Take Home Assignment\Datasets\boi_cm1.csv")
d1.shape

(64, 18)

In [11]:
#column operations
k = d1.columns
k[-1]

'screens'

In [12]:
#some basic information
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   title               64 non-null     object
 1   Release Date        64 non-null     object
 2   Gross               64 non-null     int64
 3   Release Year        64 non-null     int64
 4   duration            64 non-null     int64
 5   language            64 non-null     int64
 6   director            64 non-null     object
 7   writer              64 non-null     object
 8   production_company  63 non-null     object
 9   Lead Star           64 non-null     object
 10  genre1              64 non-null     object
 11  genre2              60 non-null     object
 12  genre3              35 non-null     object
 13  Release Month       64 non-null     int64
 14  Start Month         64 non-null     bool
 15  End Month           64 non-null     bool
 16  Budget              54 non-null     float64
 17  screens             57 non-null     float64
dtypes: bool(2), float64(2), int64(5), object(9)
memory usage: 8.2+ KB

In [13]:
#basic stats of the dataframe
d1.describe()

,Gross,Release Year,duration,language,Release Month,Budget,screens
count,6.400000e+01,64.000000,64.000000,64.000000,64.000000,5.400000e+01,57.000000
mean,1.917156e+09,2013.812500,148.265625,1.656250,7.031250,9.734722e+08,2672.807018
std,1.118596e+09,3.426669,16.233653,1.072288,3.527528,7.990018e+08,1042.021995
min,9.471000e+08,2000.000000,111.000000,1.000000,1.000000,5.750000e+07,200.000000
25%,1.112425e+09,2012.000000,137.000000,1.000000,4.750000,6.100000e+08,1750.000000
50%,1.491100e+09,2014.000000,146.500000,1.000000,7.000000,8.350000e+08,2700.000000
75%,2.188975e+09,2016.000000,159.000000,2.000000,10.000000,1.202500e+09,3500.000000
max,5.196500e+09,2019.000000,198.000000,6.000000,12.000000,5.750000e+09,4600.000000

In [16]:
d1['Release Date'] = pd.to_datetime(d1['Release Date'])
d1['Release Date'].min()

Timestamp('2006-06-23 00:00:00')

In [18]:
#categories in string columns
d1['genre1'].value_counts()

Action       35
Comedy       15
Drama         9
Biography     3
Crime         2
Name: genre1, dtype: int64

In [19]:
#check number of unique values
d1['genre1'].nunique()

5

In [20]:
d1['genre1'].unique()

array(['Action', 'Comedy', 'Biography', 'Drama', 'Crime'], dtype=object)

In [22]:
#check null values in dataframe
d1.isnull().sum()*100/len(d1)

title                  0.0000
Release Date           0.0000
Gross                  0.0000
Release Year           0.0000
duration               0.0000
language               0.0000
director               0.0000
writer                 0.0000
production_company     1.5625
Lead Star              0.0000
genre1                 0.0000
genre2                 6.2500
genre3                45.3125
Release Month          0.0000
Start Month            0.0000
End Month              0.0000
Budget                15.6250
screens               10.9375
dtype: float64

In [38]:
#categories in string columns
d1['genre3'].value_counts()*100/len(d1)

Romance     17.1875
Thriller    10.9375
Drama        9.3750
Musical      6.2500
Comedy       3.1250
Sport        3.1250
Mystery      1.5625
History      1.5625
Fantasy      1.5625
Name: genre3, dtype: float64

In [32]:
#string columns manipulations
d1.loc[d1['genre1']=='Comedy','genre1']='Action'
d1['genre1'].value_counts()*100/len(d1)

Action       78.1250
Drama        14.0625
Biography     4.6875
Crime         3.1250
Name: genre1, dtype: float64

In [39]:
#impute the missing value
d1['genre3'].fillna('Romance',inplace=True)
d1.isnull().sum()

title                  0
Release Date           0
Gross                  0
Release Year           0
duration               0
language               0
director               0
writer                 0
production_company     1
Lead Star              0
genre1                 0
genre2                 4
genre3                 0
Release Month          0
Start Month            0
End Month              0
Budget                10
screens                7
dtype: int64

In [40]:
#impute the missing value
d1['Budget'].fillna(d1['Budget'].mean(),inplace=True)
d1.isnull().sum()

title                 0
Release Date          0
Gross                 0
Release Year          0
duration              0
language              0
director              0
writer                0
production_company    1
Lead Star             0
genre1                0
genre2                4
genre3                0
Release Month         0
Start Month           0
End Month             0
Budget                0
screens               7
dtype: int64

In [41]:
k= d1.columns
k

Index(['title', 'Release Date', 'Gross', 'Release Year', 'duration',
       'language', 'director', 'writer', 'production_company', 'Lead Star',
       'genre1', 'genre2', 'genre3', 'Release Month', 'Start Month',
       'End Month', 'Budget', 'screens'],
      dtype='object')

In [42]:
#slice the dataframe
d2 = d1[['title', 'Release Date', 'Gross', 'Release Year', 'duration']]
d2.head()

             title Release Date       Gross  Release Year  duration
0                2   29-11-2018  5196500000          2018       148
1           Dangal   23-12-2016  5115800000          2016       161
2               PK   19-12-2014  4487400000          2014       153
3  Tiger Zinda Hai   22-12-2017  4324300000          2017       161
4            Sanju   29-06-2018  4308400000          2018       155

In [50]:
d2.shape

(64, 5)

In [55]:
#select the first fifteen rows of the dataframe
d3 = d2.iloc[:15,:]
d3.shape

(15, 5)

In [57]:
#save the dataframe
d2.to_excel(r"Sliced.xlsx",index=False)